applications/test/regionUncollatedFileOperation/multiRegionHeater/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

topAir
{
    dimensions      [ 0 2 -3 0 0 0 0 ];

    internalField   uniform 0.01;

    boundaryField
    {
        maxY
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
        minX
        {
            type            fixedValue;
            value           uniform 0.01;
        }
        maxX
        {
            type            inletOutlet;
            value           uniform 0.01;
            inletValue      uniform 0.01;
        }
        minZ
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
        maxZ
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
        topAir_to_rightSolid
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
        topAir_to_heater
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
        topAir_to_leftSolid
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
    }
}

botomWater
{
    dimensions      [ 0 2 -3 0 0 0 0 ];

    internalField   uniform 0.01;

    boundaryField
    {
        minX
        {
            type            fixedValue;
            value           uniform 0.01;
        }
        maxX
        {
            type            inletOutlet;
            value           uniform 0.01;
            inletValue      uniform 0.01;
        }
        minY
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
        minZ
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
        maxZ
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
        bottomWater_to_rightSolid
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
        bottomWater_to_leftSolid
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
        bottomWater_to_heater
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
    }
}


// ************************************************************************* //
