applications/test/regionUncollatedFileOperation/multiRegionHeater/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

topAir
{
    dimensions      [ 1 -1 -2 0 0 0 0 ];

    internalField   uniform 100000;

    boundaryField
    {
        maxY
        {
            type            calculated;
            value           uniform 100000;
        }
        minX
        {
            type            calculated;
            value           uniform 100000;
        }
        maxX
        {
            type            calculated;
            value           uniform 100000;
        }
        minZ
        {
            type            calculated;
            value           uniform 100000;
        }
        maxZ
        {
            type            calculated;
            value           uniform 100000;
        }
        topAir_to_rightSolid
        {
            type            calculated;
            value           uniform 100000;
        }
        topAir_to_heater
        {
            type            calculated;
            value           uniform 100000;
        }
        topAir_to_leftSolid
        {
            type            calculated;
            value           uniform 100000;
        }
    }
}

bottomWater
{
    dimensions      [ 1 -1 -2 0 0 0 0 ];

    internalField   uniform 0;

    boundaryField
    {
        minX
        {
            type            calculated;
            value           uniform 0;
        }
        maxX
        {
            type            calculated;
            value           uniform 0;
        }
        minY
        {
            type            calculated;
            value           uniform 0;
        }
        minZ
        {
            type            calculated;
            value           uniform 0;
        }
        maxZ
        {
            type            calculated;
            value           uniform 0;
        }
        bottomWater_to_rightSolid
        {
            type            calculated;
            value           uniform 0;
        }
        bottomWater_to_leftSolid
        {
            type            calculated;
            value           uniform 0;
        }
        bottomWater_to_heater
        {
            type            calculated;
            value           uniform 0;
        }
    }
}

heater
{
    dimensions      [1 -1 -2 0 0 0 0];

    internalField   uniform 100000;

    boundaryField
    {
        minY
        {
            type            calculated;
            value           uniform 100000;
        }
        minZ
        {
            type            calculated;
            value           uniform 100000;
        }
        maxZ
        {
            type            calculated;
            value           uniform 100000;
        }
        heater_to_topAir
        {
            type            calculated;
            value           uniform 0;
        }
        heater_to_rightSolid
        {
            type            calculated;
            value           uniform 0;
        }
        heater_to_leftSolid
        {
            type            calculated;
            value           uniform 0;
        }
        heater_to_bottomWater
        {
            type            calculated;
            value           uniform 0;
        }
    }
}

leftSolid
{
    dimensions      [1 -1 -2 0 0 0 0];

    internalField   uniform 100000;

    boundaryField
    {
        minX
        {
            type            calculated;
            value           uniform 100000;
        }
        minZ
        {
            type            calculated;
            value           uniform 100000;
        }
        maxZ
        {
            type            calculated;
            value           uniform 100000;
        }
        leftSolid_to_bottomWater
        {
            type            calculated;
            value           uniform 0;
        }
        leftSolid_to_heater
        {
            type            calculated;
            value           uniform 0;
        }
        leftSolid_to_topAir
        {
            type            calculated;
            value           uniform 0;
        }
    }
}

rightSolid
{
    dimensions      [1 -1 -2 0 0 0 0];

    internalField   uniform 100000;

    boundaryField
    {
        maxX
        {
            type            calculated;
            value           uniform 100000;
        }
        minZ
        {
            type            calculated;
            value           uniform 100000;
        }
        maxZ
        {
            type            calculated;
            value           uniform 100000;
        }
        rightSolid_to_bottomWater
        {
            type            calculated;
            value           uniform 0;
        }
        rightSolid_to_topAir
        {
            type            calculated;
            value           uniform 0;
        }
        rightSolid_to_heater
        {
            type            calculated;
            value           uniform 0;
        }
    }
}

// ************************************************************************* //
