applications/test/regionUncollatedFileOperation/multiRegionHeater/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bottomWater
{
    thermoType
    {
        type            heRhoThermo;
        mixture         pureMixture;
        transport       const;
        thermo          hConst;
        equationOfState rhoConst;
        specie          specie;
        energy          sensibleEnthalpy;
    }

    mixture
    {
        specie
        {
            molWeight       18;
        }
        equationOfState
        {
            rho             1000;
        }
        thermodynamics
        {
            Cp              4181;
            Hf              0;
        }
        transport
        {
            mu              959e-6;
            Pr              6.62;
        }
    }
}

topAir
{
    thermoType
    {
        type            heRhoThermo;
        mixture         pureMixture;
        transport       const;
        thermo          hConst;
        equationOfState perfectGas;
        specie          specie;
        energy          sensibleEnthalpy;
    }

    mixture
    {
        specie
        {
            molWeight       28.9;
        }
        thermodynamics
        {
            Cp              1000;
            Hf              0;
        }
        transport
        {
            mu              1.8e-05;
            Pr              0.7;
        }
    }
}

"(heater|leftSolid|rightSolid)"
{
    thermoType
    {
        type            heSolidThermo;
        mixture         pureMixture;
        transport       constIso;
        thermo          hConst;
        equationOfState rhoConst;
        specie          specie;
        energy          sensibleEnthalpy;
    }

    mixture
    {
        specie
        {
            molWeight   50;
        }

        transport
        {
            kappa   80;
        }

        thermodynamics
        {
            Hf      0;
            Cp      450;
        }

        equationOfState
        {
            rho     8000;
        }
    }
}

// ************************************************************************* //
