applications/test/regionUncollatedFileOperation/multiRegionHeater/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

"(topAir|bottomWater)"
{
    ddtSchemes
    {
        default Euler;
    }

    gradSchemes
    {
        default         Gauss linear;
    }

    divSchemes
    {
        default         none;

        div(phi,U)      Gauss upwind;
        div(phi,K)      Gauss linear;
        div(phi,h)      Gauss upwind;
        div(phi,k)      Gauss upwind;
        div(phi,epsilon) Gauss upwind;
        div(phi,R)      Gauss upwind;
        div(R)          Gauss linear;
        div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    }

    laplacianSchemes
    {
        default        Gauss linear corrected;
    }

    interpolationSchemes
    {
        default         linear;
    }

    snGradSchemes
    {
        default         corrected;
    }
}

("heater|leftSolid|rightSolid)"
{
    ddtSchemes
    {
        default Euler;
    }

    gradSchemes
    {
        default         Gauss linear;
    }

    divSchemes
    {
        default         none;
    }

    laplacianSchemes
    {
        default             none;
        laplacian(alpha,h)  Gauss linear corrected;
    }

    interpolationSchemes
    {
        default         linear;
    }

    snGradSchemes
    {
        default         corrected;
    }
}

// ************************************************************************* //
