applications/test/regionUncollatedFileOperation/multiRegionHeater/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

"(topAir|bottomWater)"
{
    solvers
    {
        rho
        {
            solver          PCG;
            preconditioner  DIC;
            tolerance       1e-7;
            relTol          0.1;
        }

        rhoFinal
        {
            $rho;
            tolerance       1e-7;
            relTol          0;
        }

        p_rgh
        {
            solver           GAMG;
            tolerance        1e-7;
            relTol           0.01;

            smoother         GaussSeidel;

        }

        p_rghFinal
        {
            $p_rgh;
            tolerance        1e-7;
            relTol           0;
        }

        "(U|h|k|epsilon|R)"
        {
            solver           PBiCGStab;
            preconditioner   DILU;
            tolerance        1e-7;
            relTol           0.1;
        }

        "(U|h|k|epsilon|R)Final"
        {
            $U;
            tolerance        1e-7;
            relTol           0;
        }
    }

    PIMPLE
    {
        momentumPredictor   yes;
        nCorrectors         2;
        nNonOrthogonalCorrectors 0;
    }

    relaxationFactors
    {
        equations
        {
            "h.*"           1;
            "U.*"           1;
        }
    }
}

("heater|leftSolid|rightSolid)"
{
    solvers
    {
        h
        {
            solver           PCG;
            preconditioner   DIC;
            tolerance        1e-06;
            relTol           0.1;
        }

        hFinal
        {
            $h;
            tolerance        1e-06;
            relTol           0;
        }
    }

    PIMPLE
    {
        nNonOrthogonalCorrectors 0;
    }
}


// ************************************************************************* //
